A database is a ny colection of related information e.g Phone Bok, Shopping list, Todo list, etc

Database (DB) can be stored in different ways. E.g On paper, In your mind, On a computer, This powerpoint, e.t.c
Computer are great at keeping track of large amounts of information

### Database Managemanet Systems (DBMS)

DBMS is  special software program that helps users create and maintain a database, thereby making it easy to do the following:
1. To manage large amounts of information
2. Handles Security
3. Backups
4. Importing/exporting data
5. Concurrency
6. Interacts with software applications like **Progamming Languages**

![](pics/dbms.png)

# C.R.U.D 
Create Read Update Delete

## Two Types of Databases
1. Relational Databases (SQL): Organize data into one or more tables:
* Each table has columns and rows.
* A unique key identifies each role.

2. Non-Relational Databases (noSQL / not just SQL): Organize data is anything but a traditional table:
* Key-value stores
* Documents (JSON, XMK, etc)
* Graphs
* Flexible Tables

### Relational Databases (SQL)
Relational Database management Systems (RDBMS): It helpls the users create and maintain a relational database like mySQL, 
Oracle, postgreSQL, mariaDB, etc.

Structured Query Language (SQL): I t performs the following operations:
* Standardized language for interacting with RDBMS
* Used to perform C.R.U.D operations, as well as other administrative tasks (user management, security, backup, etc).
* Used to define tables and structures.
* SQL code used on one RDBMS is not always portable to another without modification.

![](pics/nosql.png)

### Non-Relational Databases (noSQL / not just SQL)

Non-Relational atabase Management Systems (NRDBMS): It helps users create and maintain a non-relational database. Exampls of noSQL are: mongoDB, dynamoDB, apache casssandra, firebase, etc.

Implementation Specific
Any non-relational database falls under this category, so there's no set language standard.
Most NRDBMS will implement their own language for performing C.R.u.D and administrative operations on the database.

### Database Queries

Queries are requests made to the database management system for specific information.

As the database structure becomes more and more complex, it becomes more difficult tp get the specific pieces of information we want.

![](pics/wrapup.png)

## Tables and keys

 ![](pics/studentTable.png)

The Primary key would always be unique for each row in a table. it can be a number or a str of text but it must be unique.

![](pics/email.png)

![](pics/employee_id.png)

The emp_id is a surrogate key.  A surrogate key is a key that has not mapping to anything in the real word. Its just a type of primary key.

![](pics/natural_key.png)

The emp_ssn is a natural key. SSN means Social Security Number. A natural key is a key that has a mapping to the real world.

![](foriegn.png)

![](pics/foriegn.png)

A Foriegn key is an attribute we can store on a database table that would link us to another database table. Branch_id is a foriegn key.

A foreign key stores the primary key of a row of in another database table. Its actually a primary key in another table.

It helps us to link up and define our relationships between tables.

![](pics/branch.png)

A table can have more than one foriegn key. In the fig below: branch_id and super_id are both foreign keys.

![](pics/twokeys.png)

Branch Supplier primary key consists of two columns. Its called a composite key and a composite key is a key that needs two atrribute, its made up of two columns. branch_id & supplier_name makes up the composite key. It has 2 primary keys.

![](pics/composite.png)

![](pics/works_with.png)

 ![](pics/sql.png)

SQL concepts are the same but the implementations are not the same.

![](pics/sql_types.png)

 ![](pics/queries.png)

#### Different datatypes available in MYSQL

INT                       -- Whole Numbers

DECIMAL(M,N)              -- Exact Value - Decimal Numbers

VARCHAR(100)              -- String of text length 100

BLOB                      -- Binary Large Object, Stores large data

DATE                      -- 'YYYY-MM-DD'

TIMESTAMP                 -- 'YYYY-MM-DD HH:MM:SS' - userd for recording the time

SQL is not case sensitive i.e use can write with uppercase or lowercase but writing with uppercase is standard. Every command you write must end with a semi-colon

![](pics/student_table.png)

In [ ]:
#to create the above table
CREATE TABLE student (
    student_id INT PRIMARY KEY,
    name VARCHAR(20),
    major VARCHAR(20)
);

#click run in popsql to create the table

In [ ]:
# you can also write it this way
CREATE TABLE student (
    student_id INT,
    name VARCHAR(20),
    major VARCHAR(20),
    PRIMARY KEY(student_id)
);

In [ ]:
# you can also write it this way
CREATE TABLE student (
    student_id INT,
    name VARCHAR(20),
    major VARCHAR(20),
    PRIMARY KEY(student_id)
);

DESCRIBE student; # click run in popsql to veiw table description

In [ ]:
# To delete a table
CREATE TABLE student (
    student_id INT,
    name VARCHAR(20),
    major VARCHAR(20),
    PRIMARY KEY(student_id)
);

DESCRIBE student; # click run in popsql to veiw table description

DROP TABLE student; # click run to delete table

In [ ]:
# To modify a table
CREATE TABLE student (
    student_id INT,
    name VARCHAR(20),
    major VARCHAR(20),
    PRIMARY KEY(student_id)
);

DESCRIBE student; # click run in popsql to veiw table description

DROP TABLE student; # click run to delete table

ALTER TABLE student AA gpa DECIMAL(3, 2); # click run to modify student table

In [ ]:
# To drop a specific column
CREATE TABLE student (
    student_id INT,
    name VARCHAR(20),
    major VARCHAR(20),
    PRIMARY KEY(student_id)
);

DESCRIBE student; # click run in popsql to veiw table description

DROP TABLE student; # click run to delete table

ALTER TABLE student AA gpa DECIMAL(3, 2); # click run to modify student table
ALTER TABLE student DROP COLUMN gpa; # click run in popsql to drop gpa colukn in student table

In [ ]:
# To insert value in the student table
CREATE TABLE student (
    student_id INT,
    name VARCHAR(20),
    major VARCHAR(20),
    PRIMARY KEY(student_id)
);

INSERT INTO student VALUES(1, 'Jack', 'Biology'); # click run to insert the added value

In [ ]:
# To view inserted value in the student table
CREATE TABLE student (
    student_id INT,
    name VARCHAR(20),
    major VARCHAR(20),
    PRIMARY KEY(student_id)
);
SELECT * FROM student; # grabs all the information from the student table

INSERT INTO student VALUES(1, 'Jack', 'Biology'); # click run to view the added value

In [ ]:
CREATE TABLE student (
    student_id INT,
    name VARCHAR(20),
    major VARCHAR(20),
    PRIMARY KEY(student_id)
);
SELECT * FROM student; # grabs all the information from the student table

INSERT INTO student VALUES(2, 'Kate', 'Sociology'); # click run to view the added value

In [ ]:
CREATE TABLE student (
    student_id INT,
    name VARCHAR(20),
    major VARCHAR(20),
    PRIMARY KEY(student_id)
);
SELECT * FROM student; # grabs all the information from the student table

INSERT INTO student(student_id, name) VALUES(3, 'Claire'); # manually manupulate the inserted row to desired result
# Null would automatically be inserted to major cos no value was given to it.

A table cannot have dupicate primary key but can have the same name or major.

In [ ]:
CREATE TABLE student (
    student_id INT,
    name VARCHAR(20),
    major VARCHAR(20),
    PRIMARY KEY(student_id)
);
SELECT * FROM student; # grabs all the information from the student table

INSERT INTO student(student_id, name) VALUES(4, 'Claire'); # manually manupulate the inserted row to desired result
# click run to view the added value

In [ ]:
CREATE TABLE student (
    student_id INT,
    name VARCHAR(20),
    major VARCHAR(20),
    PRIMARY KEY(student_id)
);
SELECT * FROM student; # grabs all the information from the student table

INSERT INTO student VALUES(1, 'Jack', 'Biology');
INSERT INTO student VALUES(2, 'Kate', 'Sociology'); 
INSERT INTO student(student_id, name) VALUES(3, 'Claire'); # manually manupulate the inserted row to desired result
INSERT INTO student VALUES(4, 'Jack', 'Biology');
INSERT INTO student VALUES(5, 'Mike', 'Computer Science');

![](pics/collec.png)

Null means a coumn does not have a value.

NOT NULL allow us define that a particular column in the table cannot be NULL.

UNIQUE makes each value in the row not to be repeated or duplicated.

A Primary Key is an attribute or column on a table that is both NOT NULL and UNIQUE.

In [ ]:
CREATE TABLE student (
    student_id INT,
    #NOT NULL makes a particular column in the table
    #not to be null
    name VARCHAR(20) NOT NULL, 
    major VARCHAR(20) UNIQUE,
    PRIMARY KEY(student_id)
);
SELECT * FROM student; # grabs all the information from the student table

INSERT INTO student VALUES(1, 'Jack', 'Biology');
INSERT INTO student VALUES(2, 'Kate', 'Sociology'); 
INSERT INTO student VALUES(3, NULL, 'Chemistry');
INSERT INTO student VALUES(4, 'Jack', 'Biology');
INSERT INTO student VALUES(5, 'Mike', 'Computer Science');

In [ ]:
DROP TABLE Student; # delete table

CREATE TABLE student (
    student_id INT,
    #NOT NULL makes a particular column in the table
    #not to be null
    name VARCHAR(20), 
    major VARCHAR(20) DEFAULT 'undecided',
    PRIMARY KEY(student_id)
);
SELECT * FROM student; # grabs all the information from the student table

INSERT INTO student(student_id, name) VALUES(1, 'Jack');
INSERT INTO student VALUES(2, 'Kate', 'Sociology'); 
INSERT INTO student VALUES(3, NULL, 'Chemistry');
INSERT INTO student VALUES(4, 'Jack', 'Biology');
INSERT INTO student VALUES(5, 'Mike', 'Computer Science');

In [ ]:
DROP TABLE Student; # delete table

CREATE TABLE student (
    student_id INT AUTO_INCREMENT, #automatic increment of ID
    #NOT NULL makes a particular column in the table
    #not to be null
    name VARCHAR(20), 
    major VARCHAR(20) DEFAULT 'undecided',
    PRIMARY KEY(student_id)
);
SELECT * FROM student; # grabs all the information from the student table

INSERT INTO student(name, major) VALUES('Jack', 'Biology');
INSERT INTO student(name, major) VALUES('Kate', 'Sociology');

#### UPDATE and DELETE ROWS

#### Updating Rows or Column

![](pics/update.png)

In [ ]:
SELECT * FROM student; # grabs all the information from the student table

UPDATE student
SET major = 'Bio'
WHERE major = 'Biology';

In [ ]:
SELECT * FROM student; # grabs all the information from the student table

UPDATE student
SET major = 'Comp Sci'
WHERE major = 'Computer Science';

In [ ]:
SELECT * FROM student; # grabs all the information from the student table

UPDATE student
SET major = 'Comp Sci'
WHERE student_id = 4;

![](pics/four.png)

In [ ]:
SELECT * FROM student; # grabs all the information from the student table

UPDATE student
SET major = 'Biochemistry'
WHERE major = 'Bio' OR major = 'Chemistry';

In [ ]:
SELECT * FROM student; # grabs all the information from the student table

UPDATE student
SET name = 'Tom', major = 'undecided'
WHERE student_id = 1;

In [ ]:
SELECT * FROM student; # grabs all the information from the student table

UPDATE student
SET major = 'undecided';

#### Deleting Rows or Column

In [ ]:
SELECT * FROM student; # grabs all the information from the student table

DELETE FROM student
WHERE student_id = 5;

In [ ]:
SELECT * FROM student; # grabs all the information from the student table

DELETE FROM student
WHERE name = 'Tom' AND major = 'undecided';

In [ ]:
SELECT * FROM student; # grabs all the information from the student table

DELETE FROM student; # delete the entire table

#### BASIC QUERIES
(*) means grab all

In [ ]:
SELECT * 
FROM student; # grabs all the information from the student table

In [ ]:
SELECT name
FROM student; # grabs all the names from the student table

In [ ]:
SELECT name, major
FROM student; # grabs all the names and major from the student table

In [ ]:
SELECT student.name, student.major
FROM student; # grabs all the names and major from the student table

In [ ]:
SELECT student.name, student.major
FROM student # grabs all the names and major from the student table
ORDER BY name; # sort in alphabetical order ascending

In [ ]:
SELECT student.name, student.major
FROM student # grabs all the names and major from the student table
ORDER BY name DESC; # sort in alphabetical order descending

In [ ]:
SELECT *
FROM student # grabs all the names and major from the student table
ORDER BY student_id DESC; # sort in alphabetical order descending

In [ ]:
SELECT *
FROM student # grabs all the names and major from the student table
ORDER BY student_id ASC; # sort in alphabetical order ascending

In [ ]:
SELECT *
FROM student 
ORDER BY major, student_id; #automatically ascending

In [ ]:
SELECT *
FROM student 
ORDER BY major, student_id DESC; #automatically descending

In [ ]:
SELECT *
FROM student 
LIMIT 2;  #limit the result of the table rows shown to 2

In [ ]:
SELECT *
FROM student 
ORDER BY student_id DESC; #automatically descending
LIMIT 2;  #limit the result of the table rows shown to 2

#### Filtering Table

In [ ]:
SELECT *
FROM student 
WHERE major = 'Chemistry';

In [ ]:
SELECT name, major
FROM student 
WHERE major = 'Chemistry' OR major = 'Biology';

In [ ]:
SELECT name, major
FROM student 
WHERE major = 'Chemistry' OR name = 'Kate';

In [ ]:
SELECT name, major
FROM student 
WHERE major = 'Chemistry';

#### Comparision Operators
-- Comments

<  Less Than

'>'  Greater Than

<= Less Than Equal to

'>=' Right Than Equal to

=  Equal to

<> Not Equal to

AND

OR

In [ ]:
SELECT name, major
FROM student 
WHERE major <> 'Chemistry';

In [ ]:
SELECT name, major
FROM student 
WHERE student_id <3 ;

In [ ]:
SELECT *
FROM student 
WHERE student_id <3 AND name <> 'Jack';

In [ ]:
SELECT *
FROM student 
WHERE name IN ("Claire", "Kate", "Mike");

In [ ]:
SELECT *
FROM student 
WHERE major IN ("Biology", "Chemistry");

In [ ]:
SELECT *
FROM student 
WHERE major IN ("Biology", "Chemistry") AND student_id > 2;

### Company Database Intro

![](pics/stuinfo.png)

![](pics/schema.png)

In [ ]:
DROP TABLE student;

In [ ]:
#create employee table
CREATE TABLE employee (
    emp_id INT PRIMARY KEY,
    first_name VARCHAR(40),
    last_name VARCHAR(40),
    birth_day DATE,
    sex VARCHAR(1),
    salary INT,
    super_id INT,
    branch_id INT
); # run in popsql

In [ ]:
#create branch table
CREATE TABLE branch (
    branch_id INT PRIMARY KEY,
    branch_name VARCHAR(40),
    mgr_id INT,
    mgr_start_date DATE,
    FOREIGN KEY(mgr_id) REFERENCFES employee(emp_id) ON DELETE SET NULL
); # run in popsql

In [ ]:
# add branch_id as foreign key in employee table
ALTER TABLE employee
ADD FOREIGN KEY(branch_id)
REFERENCES branch(branch_id)
ON DELETE SET NULL; # run in popsql

# add super_id as foreign key in employee table
ALTER TABLE employee
ADD FOREIGN KEY(super_id)
REFERENCES employee(emp_id)
ON DELETE SET NULL; # run in popsql

In [ ]:
#create client table
CREATE TABLE client (
    client_id INT PRIMARY KEY,
    client_name VARCHAR(40),
    branch_id INT,
    FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE SET NULL
); # run in popsql

In [ ]:
#create works_with table
CREATE TABLE works_with (
    emp_id INT,
    client_id INT,
    total_sales INT,
    PRIMARY KEY(emp_id, client_id),
    FOREIGN KEY(emp_id) REFERENCES employee(emp_id) ON DELETE CASCADE,
    FOREIGN KEY(client_id) REFERENCES client(client_id) ON DELETE CASCADE
); # run in popsql

In [ ]:
#create Branch_Supplier table
CREATE TABLE branch_supplier (
    branch_id INT,
    supplier_name VARCHAR(40),
    supply_type VARCHAR(40),
    PRIMARY KEY(branch_id, supplier_name),
    FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE CASCADE
); # run in popsql

In [ ]:
# Insert information into tables
--Corporate Branch

INSERT INTO employee VALUES(100, "David", "Wallace", "1967-11-17", "M", 250000, NULL, NULL);

INSERT INTO branch VALUES(1, "Corporate", 100, "2006-02-09");

UPDATE employee
SET branch_id = 1
WHERE emp_id = 100;

INSERT INTO employee VALUES(101, 'Jan', 'Levinson', '1961-05-11', 'F', 110000, 100, 1); # run in popsql

In [ ]:
# Insert information into tables
--Scranton Branch

INSERT INTO employee VALUES(102, "Michael", "Scott", "1964-03-15", "M", 75000, NULL, NULL);

INSERT INTO branch VALUES(2, "Sranton", 102, "1992-04-06");

UPDATE employee
SET branch_id = 2
WHERE emp_id = 102;

INSERT INTO employee VALUES(103, 'Angela', 'Martin', '1971-06-25', 'F', 63000, 102, 2); # run in popsql
INSERT INTO employee VALUES(104, 'Kelly', 'Kapoor', '1980-02-05', 'F', 55000, 102, 2);
INSERT INTO employee VALUES(105, 'Stanley', 'Hudson', '1958-02-19', 'M', 69000, 102, 2);

In [ ]:
# Insert information into tables
--Stamford Branch

INSERT INTO employee VALUES(106, "Josh", "Porter", "1969-09-05", "M", 78000, NULL, NULL);

INSERT INTO branch VALUES(3, "Stamford", 106, "1998-02-13");

UPDATE employee
SET branch_id = 3
WHERE emp_id = 106;

INSERT INTO employee VALUES(107, 'Andy', 'Bernard', '1973-07-22', 'M', 65000, 106, 3); 
INSERT INTO employee VALUES(108, 'Jim', 'Halpert', '1970-10-01', 'M', 71000, 106, 3); # run in popsql

In [ ]:
# Insert information into tables
--Branch Supplier

INSERT INTO branch_supplier VALUES(2, "Hammer Mill", "Paper"); 
INSERT INTO branch_supplier VALUES(2, "Uni-ball", "Writing Utensils"); 
INSERT INTO branch_supplier VALUES(3, "Patriot Paper", "Paper"); 
INSERT INTO branch_supplier VALUES(2, "J.T. Forms & Labels", "Custom Forms"); 
INSERT INTO branch_supplier VALUES(3, "Uni-ball", "Writing Utensils"); 
INSERT INTO branch_supplier VALUES(3, "Hammer Mill", "Paper"); 
INSERT INTO branch_supplier VALUES(3, "Stamford Labels", "Custom Forms"); # run in popsql

In [ ]:
# Insert information into tables
--CLIENT TABLE

INSERT INTO client VALUES(400, "Dunmore Highschool", 2); 
INSERT INTO client VALUES(401, "Lackawana Country", 2); 
INSERT INTO client VALUES(402, "FedEx", 3); 
INSERT INTO client VALUES(403, "John Daly Law, LLC", 3); 
INSERT INTO client VALUES(404, "Scranton WhitePages", 2); 
INSERT INTO client VALUES(405, "Times Newspaper", 3); 
INSERT INTO client VALUES(406, "FedEx", 2); # run in popsql

In [ ]:
# Insert information into tables
--WORKS_WITH

INSERT INTO works_with VALUES(105, 400, 55000); 
INSERT INTO works_with VALUES(102, 401, 267000); 
INSERT INTO works_with VALUES(108, 402, 22500); 
INSERT INTO works_with VALUES(107, 403, 5000); 
INSERT INTO works_with VALUES(108, 403, 12000); 
INSERT INTO works_with VALUES(105, 404, 33000); 
INSERT INTO works_with VALUES(107, 405, 26000); 
INSERT INTO works_with VALUES(102, 406, 15000); 
INSERT INTO works_with VALUES(105, 406, 130000); # run in popsql

In [ ]:
# To check out the diferent table created
select * employee;

In [ ]:
# To check out the diferent table created
select * works_with;

In [ ]:
# To check out the diferent table created
SELECT * branch_supplier;

## More Basic Queries

In [ ]:
-- Find all employees
SELECT * 
FROM employee;

In [ ]:
-- Find all clients
SELECT * 
FROM client;

In [ ]:
-- Find all employes ordered by salary
SELECT * 
FROM employee
ORDER BY salary;

In [ ]:
-- Find all employes ordered by salary
SELECT * 
FROM employee
ORDER BY salary DESC;

In [ ]:
-- Find all employees ordered by sex then name
SELECT * 
FROM employee
ORDER BY sex, first_name, last_name;

In [ ]:
-- Find the first 5 employees in the table
SELECT * 
FROM employee
LIMIT 5;

In [ ]:
-- Find the first and last names of all employees
SELECT first_name, last_name
FROM employee;

In [ ]:
-- Find the forename and surnames of all employees
SELECT first_name AS forename, last_name AS surname
FROM employee;

In [ ]:
-- Find out all the different genders
SELECT DISTINCT sex
FROM employee;

In [ ]:
-- Find out all the different branch_id employee table has
SELECT DISTINCT branch_id
FROM employee;